In [1]:
import pandas as pd
from sqlalchemy import create_engine
from faker import Faker
import random

In [2]:
# Define the database URL
db_url = "postgresql://postgres:postgres@localhost:5432/EmployeeManagement"

In [3]:
# Create the engine object
engine = create_engine(db_url)

In [4]:
# Instantiate the Faker generator
fake = Faker()

In [5]:
# # Drop the existing tables

# with engine.connect() as connection:
#     connection.execute('DROP TABLE IF EXISTS contract_projects CASCADE')
#     connection.execute('DROP TABLE IF EXISTS work_locations CASCADE')
#     connection.execute('DROP TABLE IF EXISTS educations CASCADE')
#     connection.execute('DROP TABLE IF EXISTS clearances CASCADE')
#     connection.execute('DROP TABLE IF EXISTS employees CASCADE')

In [22]:
# Generate dummy data for contract projects
contract_projects = [{'contract_project_id': i+1, 'name': fake.job()} for i in range(10)]
contract_projects_df = pd.DataFrame(contract_projects)
contract_projects_df.to_sql('contract_projects', engine, if_exists='replace', index=False)

# Generate dummy data for work locations
work_locations = [{'work_location_id': i+1, 'name': fake.city()} for i in range(5)]
work_locations_df = pd.DataFrame(work_locations)
work_locations_df.to_sql('work_locations', engine, if_exists='replace', index=False)

# Generate dummy data for educations
educations = [{'education_id': i+1, 'level': level} for i, level in enumerate(["High School", "Bachelor's", "Master's", "Ph.D."])]
educations_df = pd.DataFrame(educations)
educations_df.to_sql('educations', engine, if_exists='replace', index=False)

# Generate dummy data for clearances
clearances = [{'clearance_id': i+1, 'level': level, 'status': status} for i, level in enumerate(["Confidential", "Secret", "Top Secret"])
              for status in ["Active", "Inactive"]]
clearances_df = pd.DataFrame(clearances)
clearances_df.to_sql('clearances', engine, if_exists='replace', index=False)

# Generate dummy data for employees
employees_data = []
for _ in range(1000):
    contract_project_id = random.randint(1, len(contract_projects))
    work_location_id = random.randint(1, len(work_locations))
    years_of_experience = random.randint(0, 30)
    education_id = random.randint(1, len(educations))
    clearance_id = random.randint(1, len(clearances))
    origination_date = fake.date_between(start_date='-5y', end_date='today')
    reinvestigation_date = fake.date_between(start_date=origination_date, end_date='today')
    name = fake.name()

    employees_data.append({
        'name': name,
        'contract_project_id': contract_project_id,
        'work_location_id': work_location_id,
        'years_of_experience': years_of_experience,
        'education_id': education_id,
        'clearance_id': clearance_id,
        'origination_date': origination_date,
        'reinvestigation_date': reinvestigation_date
    })

employees_df = pd.DataFrame(employees_data)

# Add foreign key columns from related tables
employees_df['clearance_id'] = employees_df['clearance_id'].apply(lambda x: clearances_df.loc[x-1, 'clearance_id'])
employees_df['contract_project_id'] = employees_df['contract_project_id'].apply(lambda x: contract_projects_df.loc[x-1, 'contract_project_id'])
employees_df['education_id'] = employees_df['education_id'].apply(lambda x: educations_df.loc[x-1, 'education_id'])
employees_df['work_location_id'] = employees_df['work_location_id'].apply(lambda x: work_locations_df.loc[x-1, 'work_location_id'])

employees_df.to_sql('employees', engine, if_exists='replace', index=False)

print("Dummy data inserted successfully.")

Dummy data inserted successfully.

# Query Examples

## Retrieve all employees' names:

In [23]:
# Retrieve all employees' names:

# Query all employee names
query = "SELECT * FROM employees"
employees_names_df = pd.read_sql(query, engine)

# Display the result
employees_names_df

,name,contract_project_id,work_location_id,years_of_experience,education_id,clearance_id,origination_date,reinvestigation_date
0,Jessica Orozco,1,5,27,3,3,2021-06-17,2022-11-11
1,Tanya Larson,7,2,16,2,3,2021-08-17,2022-04-09
2,Steven Ward,5,5,15,3,1,2022-10-21,2022-12-20
3,Christopher Padilla,3,1,16,1,1,2022-10-17,2023-03-16
4,Cynthia Harris,2,4,25,1,1,2020-10-02,2021-05-09
...,...,...,...,...,...,...,...,...
995,Phillip Burns Jr.,5,3,18,4,1,2020-04-17,2022-07-25
996,Joseph Solis,3,1,27,4,1,2022-06-19,2022-11-13
997,Sarah Banks,4,2,13,1,3,2021-10-16,2022-05-31
998,Miguel Adams,9,4,27,1,2,2020-02-22,2022-12-13
999,Mrs. Danielle Hahn,4,5,3,2,3,2019-08-13,2020-05-18

## Retrieve the total number of employees:

In [24]:
# Retrieve the total number of employees:
query = """
SELECT COUNT(*) FROM employees;
"""

# Execute the query and fetch the data into a DataFrame
employee_count = pd.read_sql(query, engine)

# Display the result
print(employee_count)

   count
0   1000

## Retrieve all employees with their corresponding contract project details:

In [25]:
# Retrieve all employees with their corresponding contract project details:

query = """
SELECT e.name, cp.name AS contract_project_name
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id;
"""
contract_project = pd.read_sql(query, engine)

# Display the result
contract_project

                    name          contract_project_name
0    Christopher Shelton  Clothing/textile technologist
1           Summer Woods  Clothing/textile technologist
2            Kara Strong  Clothing/textile technologist
3          Joyce Johnson  Clothing/textile technologist
4         Scott Mitchell  Clothing/textile technologist
..                   ...                            ...
995           Emily York                 Chief of Staff
996      Cheyenne Campos                 Chief of Staff
997           Megan Ford                 Chief of Staff
998           Holly Ross                 Chief of Staff
999          Kelli Reyes                 Chief of Staff

[1000 rows x 2 columns]

In [39]:
contract_project['contract_project_name'].unique()

array(['Clothing/textile technologist', 'Therapeutic radiographer',
       'Hospital doctor', 'Landscape architect', 'Tour manager',
       'Chief of Staff', 'Designer, multimedia',
       'Psychologist, sport and exercise', 'Operations geologist'],
      dtype=object)

## Retrieve all employees with their corresponding work location details:

In [26]:
# Retrieve all employees with their corresponding work location details:

# Query employees with more than 10 years of experience and their work locations
query = """
SELECT e.name, wl.name AS work_location_name
FROM employees e
JOIN work_locations wl ON e.work_location_id = wl.work_location_id;
"""
employee_locations = pd.read_sql(query, engine)

# Display the result
employee_locations

               name work_location_name
0       Jesse Jones    Mcdonaldchester
1      Jeffrey Rose    Mcdonaldchester
2       Laura Brown    Mcdonaldchester
3     Ashley Sutton    Mcdonaldchester
4    Brandy Johnson    Mcdonaldchester
..              ...                ...
995     Derek White      Stephanieberg
996   Madison Smith      Stephanieberg
997    David Abbott      Stephanieberg
998    Monica Moore      Stephanieberg
999    Willie Klein      Stephanieberg

[1000 rows x 2 columns]

In [27]:
# Retrieve all employees with their corresponding education level:

query = """
SELECT e.name, ed.level AS education_level
FROM employees e
JOIN educations ed ON e.education_id = ed.education_id;
"""
education_level = pd.read_sql(query, engine)

# Display the result
education_level

                name education_level
0         Carl Owens     High School
1      Andrea Spence     High School
2        Darren Luna     High School
3    Mason Casey DDS     High School
4    Christina Brown     High School
..               ...             ...
995    Elijah Hanson           Ph.D.
996   Matthew Turner           Ph.D.
997      Mark Larson           Ph.D.
998    Suzanne Kelly           Ph.D.
999  Cassandra Lopez           Ph.D.

[1000 rows x 2 columns]

In [28]:
# Retrieve all employees with their corresponding clearance level and status:

query = """
SELECT e.name, c.level AS clearance_level, c.status AS clearance_status
FROM employees e
JOIN clearances c ON e.clearance_id = c.clearance_id;
"""
clearance_level = pd.read_sql(query, engine)

# Display the result
clearance_level

                    name clearance_level clearance_status
0         Jessica Orozco      Top Secret         Inactive
1         Jessica Orozco      Top Secret           Active
2           Tanya Larson      Top Secret         Inactive
3           Tanya Larson      Top Secret           Active
4            Steven Ward    Confidential         Inactive
...                  ...             ...              ...
1995         Sarah Banks      Top Secret           Active
1996        Miguel Adams          Secret         Inactive
1997        Miguel Adams          Secret           Active
1998  Mrs. Danielle Hahn      Top Secret         Inactive
1999  Mrs. Danielle Hahn      Top Secret           Active

[2000 rows x 3 columns]

In [29]:
# Retrieve all employees who have a Top Secret clearance:

query = """
SELECT e.name
FROM employees e
JOIN clearances c ON e.clearance_id = c.clearance_id
WHERE c.level = 'Top Secret';
"""
top_clearance = pd.read_sql(query, engine)

# Display the result
top_clearance

                   name
0        Jessica Orozco
1        Jessica Orozco
2          Tanya Larson
3          Tanya Larson
4       Virginia Zuniga
..                  ...
691       Jessica Clark
692         Sarah Banks
693         Sarah Banks
694  Mrs. Danielle Hahn
695  Mrs. Danielle Hahn

[696 rows x 1 columns]

In [41]:
# Retrieve all employees who are assigned to a specific contract project:

# query = """
# SELECT e.name
# FROM employees e
# JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
# WHERE cp.name = 'Contract Project Name';
# """


query = """
SELECT e.name
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
WHERE cp.name = 'Psychologist, sport and exercise';

"""
specific_contract_project = pd.read_sql(query, engine)

# Display the result
specific_contract_project

                name
0     Veronica Oneal
1   Angela Armstrong
2       Curtis Miles
3   Russell Martinez
4           Jane Lee
..               ...
78  Jennifer Schmidt
79       Caleb Jones
80   Rachel Mitchell
81      Meagan Smith
82    Alicia Hampton

[83 rows x 1 columns]

In [31]:
# Retrieve the average years of experience for employees:
query = """
SELECT AVG(years_of_experience) AS average_experience
FROM employees;
"""
average_experience = pd.read_sql(query, engine)

# Display the result
average_experience

   average_experience
0              15.232

In [32]:
# Retrieve the count of employees per education level:

query = """
SELECT ed.level AS education_level, COUNT(*) AS employee_count
FROM employees e
JOIN educations ed ON e.education_id = ed.education_id
GROUP BY ed.level;
"""
employee_education_count = pd.read_sql(query, engine)

# Display the result
employee_education_count

  education_level  employee_count
0           Ph.D.             231
1        Master's             267
2     High School             243
3      Bachelor's             259

In [33]:
# Retrieve the employees who have an active clearance:
query = """
SELECT e.name
FROM employees e
JOIN clearances c ON e.clearance_id = c.clearance_id
WHERE c.status = 'Active';
"""
active_clearance= pd.read_sql(query, engine)

# Display the result
active_clearance

                    name
0         Jessica Orozco
1           Tanya Larson
2            Steven Ward
3    Christopher Padilla
4         Cynthia Harris
..                   ...
995    Phillip Burns Jr.
996         Joseph Solis
997          Sarah Banks
998         Miguel Adams
999   Mrs. Danielle Hahn

[1000 rows x 1 columns]

In [34]:
# Retrieve the employees who have more than 10 years of experience:

query = """
SELECT e.name, e.years_of_experience
FROM employees e
WHERE e.years_of_experience > 10;
"""
over_10_years = pd.read_sql(query, engine)

# Display the result
over_10_years

                    name  years_of_experience
0         Jessica Orozco                   27
1           Tanya Larson                   16
2            Steven Ward                   15
3    Christopher Padilla                   16
4         Cynthia Harris                   25
..                   ...                  ...
648       Alicia Hampton                   27
649    Phillip Burns Jr.                   18
650         Joseph Solis                   27
651          Sarah Banks                   13
652         Miguel Adams                   27

[653 rows x 2 columns]

In [35]:
# Retrieve the count of employees per work location:

query = """
SELECT wl.name AS work_location, COUNT(*) AS employee_count
FROM employees e
JOIN work_locations wl ON e.work_location_id = wl.work_location_id
GROUP BY wl.name;
"""
employee_location_count = pd.read_sql(query, engine)

# Display the result
employee_location_count

     work_location  employee_count
0  Mcdonaldchester             178
1       Arnoldland             202
2  South Nancyside             214
3        Millsland             216
4    Stephanieberg             190

In [36]:
# Retrieve the average years of experience per contract project:

query = """
SELECT cp.name AS contract_project, AVG(e.years_of_experience) AS average_experience
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
GROUP BY cp.name;
"""
average_years_exp_contract = pd.read_sql(query, engine)

# Display the result
average_years_exp_contract

                   contract_project  average_experience
0                   Hospital doctor           14.965217
1              Designer, multimedia           14.892157
2          Therapeutic radiographer           15.898990
3                    Chief of Staff           15.353535
4              Operations geologist           15.423077
5               Landscape architect           15.136842
6     Clothing/textile technologist           15.134831
7                      Tour manager           14.921739
8  Psychologist, sport and exercise           15.337349

In [37]:
# Retrieve the employees with their contract project, work location, and education level:

query = """
SELECT e.name, cp.name AS contract_project, wl.name AS work_location, ed.level AS education_level
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
JOIN work_locations wl ON e.work_location_id = wl.work_location_id
JOIN educations ed ON e.education_id = ed.education_id;
"""
contract_project_location_education = pd.read_sql(query, engine)

# Display the result
contract_project_location_education

,name,contract_project,work_location,education_level
0,Cynthia Anderson,"Designer, multimedia",South Nancyside,High School
1,Claire Flores,Tour manager,Mcdonaldchester,High School
2,Andrew Mathis,Chief of Staff,Stephanieberg,High School
3,Matthew Reyes,Operations geologist,Mcdonaldchester,High School
4,Darren Luna,Operations geologist,Arnoldland,High School
...,...,...,...,...
995,Deborah Wood,"Psychologist, sport and exercise",South Nancyside,Ph.D.
996,Jonathan Oliver,"Psychologist, sport and exercise",South Nancyside,Ph.D.
997,Christopher Young,"Psychologist, sport and exercise",South Nancyside,Ph.D.
998,Angelica Thomas,Chief of Staff,Arnoldland,Ph.D.
999,Mark Whitehead,"Psychologist, sport and exercise",South Nancyside,Ph.D.